# Creating Series & DataFrame

## 1. Create a Series from a List

In [1]:
import pandas as pd

In [3]:
s = pd.Series([10,20,30,40,50])
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

## 2. Create a Series from a Dict

In [4]:
marks = pd.Series({
    "Phy": 88,
    "Chem": 85,
    "Math": 98
})
marks

Phy     88
Chem    85
Math    98
dtype: int64

## 3. Create a DataFrame from Lists

In [5]:
df = pd.DataFrame({
    "Name": ["Aaa", "Bbb", "Ccc"],
    "Age": [12, 23, 34],
    "City": ["Yyy", "Xxx", "Zzz"]
})
df

  Name  Age City
0  Aaa   12  Yyy
1  Bbb   23  Xxx
2  Ccc   34  Zzz

## 4. Create a DataFrame from a List of Dicts

In [6]:
data = [
    {"Name": "Aaa", "Age": 22,  "City": "Pune"},
    {"Name": "Ggg", "Age": 32,  "City": "Mumbai"},
    {"Name": "Kkk", "Age": 12,  "City": "Delhi"},
]
df = pd.DataFrame(data)
df

  Name  Age    City
0  Aaa   22    Pune
1  Ggg   32  Mumbai
2  Kkk   12   Delhi

## 5. Create a DataFrame from NumPy Arrays

In [7]:
import numpy as np

In [10]:
arr = np.array([[10, 20, 30],
               [40, 50, 60]])
df_1 = pd.DataFrame(arr, columns=[1, 2, 3], index=["A", "B"])

df_1

    1   2   3
A  10  20  30
B  40  50  60

# Practice Time

1. Create a Series of 5 cities.
2. Create a Series using a dictionary of 3 subjects â†’ marks.
3. Create a DataFrame with columns: Product, Price, Rating. (3 rows)
4. Convert a NumPy array of shape (3, 2) into a DataFrame with column names.

In [14]:
# 1
cities = pd.Series(["Pune", "Mumbai", "Delhi", "Nagpur", "New-Mumbai"])
cities

0          Pune
1        Mumbai
2         Delhi
3        Nagpur
4    New-Mumbai
dtype: object

In [15]:
# 2
data = {
    "Phy": 90,
    "Chem": 80,
    "Maths": 91
}
marks = pd.Series(data)
marks

Phy      90
Chem     80
Maths    91
dtype: int64

In [16]:
# 3
new_data = {
    "Product": ["Glass", "Cup", "Mug"],
    "Price": [10, 20, 30],
    "Rating": [4, 5, 3]
}
details = pd.DataFrame(new_data)
details

  Product  Price  Rating
0   Glass     10       4
1     Cup     20       5
2     Mug     30       3

In [25]:
arr = np.ones(shape=(3,2), dtype=bool)
converted_df = pd.DataFrame(arr, columns=["A", "B"], index=['x', 'y', 'z'])
converted_df

      A     B
x  True  True
y  True  True
z  True  True

# Mini Task
Create a DataFrame representing 5 students with columns:  
Name  
Math  
Science  
English  

Then:
1. Print the DataFrame
2. Show .dtypes
3. Show first 2 rows using .head(2)

In [27]:
students = [
    {"Name": "abc", "math": 98, "science": 88, "english": 92},
    {"Name": "def", "math": 92, "science": 78, "english": 88},
    {"Name": "ghi", "math": 90, "science": 78, "english": 92},
    {"Name": "jkl", "math": 81, "science":68, "english": 92}
]

In [29]:
# 1
stud_df = pd.DataFrame(students)
stud_df

  Name  math  science  english
0  abc    98       88       92
1  def    92       78       88
2  ghi    90       78       92
3  jkl    81       68       92

In [31]:
# 2
stud_df.dtypes

Name       object
math        int64
science     int64
english     int64
dtype: object

In [34]:
# 3
stud_df.head(2)

  Name  math  science  english
0  abc    98       88       92
1  def    92       78       88

In [37]:
new_stud_df = pd.DataFrame(students, index=["A","B","C","D"])
new_stud_df

  Name  math  science  english
A  abc    98       88       92
B  def    92       78       88
C  ghi    90       78       92
D  jkl    81       68       92